sdaiRemoveModelBN(Sdai_instS*,Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Removes a specified model from a schema instance.
\param schemaInstance [in] A schema instance.
\param repository     [in] A repository where the model should be found by its name.
\param modelName      [in] A string that contains the name of the model to be removed.
\remarks
This function is not implemented yet.
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiSI_NEXS - Schema instance does not exist.
* sdaiRP_NOPN - Repository is not open.
* sdaiRP_NEXS - Repository does not exist.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiMO_NEXS - SDAI-model does not exist.
* sdaiMO_NVLD - SDAI-model invalid.
* sdaiVT_NVLD - Name value type is invalid.
* sdaiSY_ERR - Underlying system error.